Revit 2027 API
Form.CanManipulateSubElement Method
Tell if a sub element can be deleted/moved/rotated/scaled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanManipulateSubElement(
	Reference subElementReference
)
Public Function CanManipulateSubElement (
	subElementReference As Reference
) As Boolean
public:
bool CanManipulateSubElement(
	Reference^ subElementReference
)
member CanManipulateSubElement :
        subElementReference : Reference -> bool
Parameters
subElementReference Reference
The geometry reference of face/edge/curve/vertex
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace